/*
 * Створити базовий клас «Музичний інструмент» і похідні класи: «Скрипка», «Тромбон», «Укулеле», «Віолончель».
 * За допомогою конструктора, встановити назву до кожного музичного інструменту і його характеристики.
 * Реалізуйте для кожного з класів методи:
 * ■ Sound — видає звук музичного інструменту (пишемо текстом у консоль);
 * ■ Show — відображає назву музичного інструменту;
 * ■ Desc — відображає опис музичного інструменту;
 * ■ History — відображає історію створення музичного інструменту.
 * Додати iнкапсуляцiю до полiв та методiв якщо треба.
 */
namespace C_Pro_Practice.HW2;

public class MusicalInstrument
{
    
}